trade_exp/src/Catalogs/ИнтервалыДоставки/ИнтервалыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="790f8dff-28d5-46ce-87ec-875605f8573b">
  <name>ИнтервалыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ababf069-c0c8-476d-965c-81e896b42038">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="11aa7568-4f6b-4d95-b77a-6648de990a0e">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="177bd090-bd38-4812-8606-8c6dacceb3d4">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5f6ddd6a-9ce2-4e89-8324-896f2667fe88">
    <name>КоличествоДоставок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db6eb09f-e9a5-44cd-81d1-884dd38e2c6d">
    <name>ДеньНедели</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c420361e-1ec9-4179-8056-9dc57f142971">
    <name>ИнтервалЗакрытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4bc74913-8bb1-4d8e-914e-6bdfc8c8689b">
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1d18bc9-dc6c-4e19-a673-a4c6fc2fb79c">
    <name>МксКолДоставокСРазгрузкой</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="55456ee3-7e27-4795-a7bb-216c440e183a">
    <name>НаименованиеНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bab7a7d5-47d2-4e3d-b16c-7879686d51c9">
    <name>ЗакрыватьСКонцаИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf3cea7f-a8c0-450d-a1e0-1af4e3c11936">
    <name>ЭкспрессДоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8ee9426-0e7f-4e38-84d1-1a7a80e9e783">
    <name>ЗакрытиеИнтервалаПоРазгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e88e37e-f9ed-4160-8573-4f3dd23fd818">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4ba175c-5e65-40ed-8e54-fe33435b3ade">
    <name>СМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b6364f-bee0-4dc6-8d83-5ce2b2ad85c2">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab4e1dc3-002e-4ec2-8419-e1b89bd1101e">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61515652-c89c-4de0-950d-034f7fc11df3">
    <name>КоличествоДней</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Enums/ВидыДоставокДоКлиента/ВидыДоставокДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДоставокДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cc6bd2-b207-434d-b027-c3ef416c447c">
    <name>Розничная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cebbe69-bf66-4554-90d5-9fe9e46e6dbf">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4da8f5b7-705c-495c-976b-5d4823a1f879">
    <name>Внутренняя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e3544ba3-ce9f-46e6-9877-fa2b4b9656af">
    <name>ДистрибуцияСборныеГрузы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ИнтервалыДоставки/Forms/ФормаВыбораВРейсе/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстЗапроса = Справочники.ИнтервалыДоставки.ПолучитьТекстЗапросаДляВыбораИнтервала();
	Список.ТекстЗапроса = ТекстЗапроса;
	
	Если Параметры.Свойство("МониторИнтервалов") Тогда
		ДатаОтгрузки = НачалоДня(ТекущаяДата());
		Элементы.ДатаОтгрузки.Видимость = Истина;
		Подразделение = Пользователи.ТекущийПользователь().Подразделение;
		ВидДоставки = Перечисления.ВидыДоставокДоКлиента.Розничная;
		Элементы.Список.РежимВыбора = Ложь;
		Элементы.ГруппаШапка.Видимость = Истина;
		ДоставкаСРазгрузкой = Ложь;
	Иначе 
		СкрытьЗакрытыеИнтервалы = Истина;
		СкрытьОтобразитьЗакрытыеНаСервере();
		
		ДатаОтгрузки = Параметры.ДатаОтгрузки;
		Подразделение = Параметры.Подразделение;
		ВидДоставки = Параметры.ВидДоставки;
		Элементы.Список.РежимВыбора = Истина;
		Элементы.ГруппаШапка.Видимость = Ложь;
		Если Параметры.Свойство("ДоставкаСРазгрузкой") Тогда
			ДоставкаСРазгрузкой = Параметры.ДоставкаСРазгрузкой;
		Иначе
			ДоставкаСРазгрузкой = Ложь;
		КонецЕсли;
		
		Если Параметры.Свойство("НетНомераДекларацииЕГАИСуЮрЛица") Тогда
			НетНомераДекларацииЕГАИСуЮрЛица = Параметры.НетНомераДекларацииЕГАИСуЮрЛица;
		Иначе
			НетНомераДекларацииЕГАИСуЮрЛица = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ЭтоЛогист() Тогда
		ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Ссылка);
	Иначе
		Если ТекущиеДанные.МожноВыбрать Тогда
			Если ТекущиеДанные.ДоступноНаСегодня <= 0 Тогда
				ПоказатьПредупреждение(,"Лимит доставок в выбранном интервале закончился."+Символы.ПС+"Выберите другой интервал", 3);
			ИначеЕсли ДоставкаСРазгрузкой И ТекущиеДанные.ДоступноНаСегодняСРазгрузкой <= 0 Тогда
				ПоказатьПредупреждение(,"Лимит доставок  с разгрузкой в выбранном интервале закончился."+Символы.ПС+"Выберите другой интервал", 3);
			Иначе
				ОповеститьОВыборе(ТекущиеДанные.Ссылка);				
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(,"Время выбора интервала закончилось."+Символы.ПС+"Выберите другой интервал", 3);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоЛогист()
	Возврат РольДоступна("ОтделЛогистики");
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОтгрузки", ДатаОтгрузки);
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	Список.Параметры.УстановитьЗначениеПараметра("ВидДоставки", ВидДоставки); 
	Если ДеньНедели(ДатаОтгрузки) < 6  И ВидДоставки <> Перечисления.ВидыДоставокДоКлиента.СборнаяОРК Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДеньНедели", 0);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ДеньНедели", ДеньНедели(ДатаОтгрузки));
	КонецЕсли;
	Если НетНомераДекларацииЕГАИСуЮрЛица Тогда
		Список.Параметры.УстановитьЗначениеПараметра("КорИнтервала", 30);
	Иначе 
		Список.Параметры.УстановитьЗначениеПараметра("КорИнтервала", 0);
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДоставкаСРазгрузкой", ДоставкаСРазгрузкой);
	
	//отборы
	Если ДоставкаСРазгрузкой Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"КоличествоСРазгрузкойПоУмолчанию", 0, ВидСравненияКомпоновкиДанных.Больше);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура СкрытьОтобразитьЗакрытыеНаСервере()
	
	Если СкрытьЗакрытыеИнтервалы Тогда  
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Закрыт",Ложь, ВидСравненияКомпоновкиДанных.равно,,Истина);
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Закрыт",Ложь, ВидСравненияКомпоновкиДанных.равно,,Ложь);		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СкрытьОтобразитьЗакрытые(Команда)   
	
	СкрытьЗакрытыеИнтервалы = Не СкрытьЗакрытыеИнтервалы;
	СкрытьОтобразитьЗакрытыеНаСервере(); 
	
КонецПроцедуры


&НаСервере
Процедура ГруппаИнтерваловПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(ГруппаИнтервалов) Тогда  
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Родитель",ГруппаИнтервалов,ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
	Иначе 
        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"Родитель",ГруппаИнтервалов,ВидСравненияКомпоновкиДанных.ВИерархии,,Ложь);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ГруппаИнтерваловПриИзменении(Элемент)
	ГруппаИнтерваловПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	
	ОбновитьНаСервере();
	
КонецПроцедуры
